public class it_05_数据类型 {
    /*
    我们知道计算机是可以用来存储数据的，
    但是无论是内存还是硬盘，计算机存储设
    备的最小信息单元叫“位（bit）”，我们
    又称之为“比特位”，通常用小写的字母”b”
    表示。而计算机中最小的存储单元叫“字节
    （byte）”，通常用大写字母”B”表示，字节
    是由连续的8个位组成。
     */
    // 1B = 8 bit 一个字节八个位
    // 1k = 1024B 一个k是1024个字节
    // 1m = 1024  一兆是1024个k
    // 1GB = 1024M
    // 1TB = 1014GB
    // 1PB = 1024PB
    // 1EB = 1024PB

    /*
    数据类型分两类 基本数据类型 和引用数据类型
    基本数据类型又分为4类8种
        四类 整数 浮点 字符串 加 布尔
        八种分别对应
        byte short int long
        float double
        char
        boolean

    引用数据类型 有类,接口,数组
     */

    // 这里就介绍基本数据类型
    /*
        byte 占一个位 数据范围-128~127 一共2的8次方个数
        short 2 字节
        int 4 字节
        long 8 字节
        float 4 字节
        double 8 字节
        char 2 字节
        boolean 1 字节  但是他的值只有 true false
     */
}
