public class it_08_两个数组的内存图 {
    public static void main(String[] args) {
        //1.定义一个长度为3的int类型的数组.
        int[] arr = new int[3];             //0, 0, 0
        //2.修改数组中的第一个元素为: 11
        arr[0] = 11;                        //11, 0, 0
        //3.打印数组中的第一, 第二个元素.
        System.out.println(arr[0]);         //11
        System.out.println(arr[1]);         //0
        //4.打印数组对象.
        System.out.println(arr);            //地址值
        //5.定义一个int类型的数组, 存储元素1, 2.
        int[] arr2 = new int[]{1, 2};       //1, 2
        //6.修改数组的第二个元素值为: 22.
        arr2[1] = 22;                       //1, 22
        //7.打印数组的第二个元素.
        System.out.println(arr2[1]);        //22
        //8.打印数组对象.
        System.out.println(arr2);           //地址值
    }
}
/*
 ____________________________________________________________________________________|
 |                                                                                   |
 |                                       堆                                            |
 |                                   ___________________________________________     |                                                 |
 |                                  |                                          |     |
 |   |                     |        |          ___________                     |     |
 |   |                     |        |     arr |_1_|_2_|_3_|                    |     |
 |   |      栈             |        |          ___________                      |     |
 |   |                     |        |    arr2 |_1_|_2_|_3_|                     |     |
 |   |                     |        |__________________________________________|     |
 |   |                     |                                                         |
 |   |                     |                                                         |
 |   |                     |            方法区                                       |
 |   |                     |        ___________________________________________      |
 |   |                     |       |  代码区    方法区      静态区      常量池  |      |
 |   | new int[3];         |       |   ______   ______     ____        ____   |      |
 |   | arr[0] = 11;        |       |  |     |  |     |    |   |       |   |   |      |
 |   | println(arr[0]);    |       |  |     |  |     |    |   |       |   |   |      |
 |   | println(arr[1]);    |       |  |     |  |     |    |   |       |   |   |      |
 |   | println(arr);       |       |  |_____|  |_____|    |___|       |___|   |      |
 |   | new int[]{1, 2};    |       |__________________________________________|      |
 |   |_____________________|                                                         |
 |                                                                                   |
 |___________________________________________________________________________________|

 */
// 内存图如上
/*
1. it_07_两个数组的内存图 进入代码区
2. main方法进栈
3. 执行第一条语句,第一条语句创建数组 在堆中创建
4. 执行第二条语句,在栈中取数据打印
5. 执行第三条语句,在栈中取数据打印
5. 执行第四条语句,在栈中取数据打印
6. 在栈中创建数组
6. main 方法执行完弹出

 */
