/*
     JVM的内存划分:
         1. 栈
             作用:
                 存储局部变量以及所有代码的执行的.
                 //局部变量: 就是定义在方法中或者方法声明上的变量.
             特点:
                 先进后出, 后进先出.             //用完就释放.
         2. 堆
             作用:
                 存储所有new出来的内容(对象)
             特点:
                 在不确定的时间, 被GC(Java中的垃圾回收机制)回收.
         3. 方法区
             作用:
                 用来存储 字节码文件, 静态成员, 常量, 具体的方法等内容.
             分类:
                 代码区, 方法区, 常量池, 静态区.
         4. 本地方法区
             给本地方法(native修饰的方法)使用的, 我们了解即可.
         5. 寄存器
             给CPU使用的, 我们了解即可.
 */
/*
        ____________________________________________________________________________________|
        |                                                                                   |
        |                                       堆                                            |
        |                                   ___________________________________________     |                                                 |
        |                                  |                                          |     |
        |   |                     |        |                                          |     |
        |   |                     |        |                                          |     |
        |   |      栈             |        |                                          |     |
        |   |                     |        |                                          |     |
        |   |                     |        |__________________________________________|     |
        |   |                     |                                                         |
        |   |                     |                                                         |
        |   |                     |            方法区                                       |
        |   |                     |        ___________________________________________      |
        |   |                     |       |  代码区    方法区      静态区      常量池  |      |
        |   |                     |       |   ______   ______     ____        ____   |      |
        |   |                     |       |  |     |  |     |    |   |       |   |   |      |
        |   |                     |       |  |     |  |     |    |   |       |   |   |      |
        |   |                     |       |  |     |  |     |    |   |       |   |   |      |
        |   |                     |       |  |_____|  |_____|    |___|       |___|   |      |
        |   |                     |       |__________________________________________|      |
        |   |_____________________|                                                         |
        |                                                                                   |
        |___________________________________________________________________________________|

 */



public class it_06_JVM内存划分 {
    public static void main(String[] args) {

    }
}
